/* Generated by StringsEditor */

"切换服务" = "Services";

"代理设置" = "Proxy";

"不修改系统代理设置" = "Don't Modify System Proxy";

"作为系统全局代理" = "Use as System Global Proxy";

"使用“自动代理配置（PAC）”" = "Use \"Automatic Proxy Configuration (PAC)\"";

"显示主窗口" = "Show Main Window";

"检查更新..." = "Check Updates...";

"关于 GoAgentX" = "About GoAgentX";

"退出" = "Quit";

"状态" = "Status";

"服务" = "Services";

"服务配置" = "Services Configuration";

"其他设置" = "General";

"本地端口：" = "Local Port:";

"分享给局域网使用" = "Share Service to Local Network";

"服务器 App ID：" = "Server App ID:";

"填写您的 App Engine ID，多个用坚线“|”隔开" = "Fill your App Engine ID, seperate by \"|\" if have multiple App IDs";

"使用 PHP Fetch，上面的地址填 PHP 服务地址" = "Use PHP Fetch, fill PHP service address above";

"服务密码：" = "Service Password:";

"如果设置了服务密码，请填写" = "Fill service password if you set it";

"启用混淆，需要服务端版本 >= 2.1.17" = "Enable obfuscate, needs server version >= 2.1.17";

"连接模式：" = "Connect Mode:";

"HTTPS 保密性更好，但速度较慢" = "HTTPS has more secruity, but slower";

"选择服务器：" = "Server Host:";

"如果使用 CN 无法连接，可以尝试 HK" = " ";

"使用代理服务器" = "Use Secondary Proxy";

"代理服务器：" = "Proxy Server:";

"代理服务器端口：" = "Proxy Port:";

"代理服务器的地址" = "Proxy Server Address";

"代理服务器的端口，例如 8080" = "Proxy Server Port, such as 8080";

"用户名：" = "Username:";

"代理服务器的用户名，可不填" = "Proxy Server Username, optional";

"密码：" = "Password:";

"代理服务器的密码，可不填" = "Proxy Server Password, optional";

"您在 App Engine 申请的 App ID，多个以 | 分隔" = "The App IDs applied on App Engine, seperate with | if have multiple";

"您的 App Engine 账户的邮件地址" = "Your App Engine account's email";

"您的 App Engine 账户的密码" = "Your App Engine account's password";

"如果想防止 goagent 被匿名使用，可以设置密码，建议设置" = "Recommend for avoiding goagent used by other peoples";

"类型：" = "Types:";

"注：目前只支持部署 goagent Python 版本服务端到 Google App Engine（http://appengine.google.com/）。\n\n完成配置后请进入“状态”标签开始部署。" = "Only supports deploy goagent to Google App Engine now.";

"goagent 服务端" = "goagent server";

"西厢" = "west chabmer";

"远程 DNS 地址：" = "Remote DNS:";

"用于解析域名的 DNS" = "Remote DNS Server";

"goagent 服务：" = "goagent server:";

"goagent 密码：" = "goagent password:";

"导入 goagent 根证书" = "Import goagent CA";

"默认情况下，访问 HTTPS 网站会提示证书错误，导入证书可以解决这个问题。导入后请修改证书信任设置中“加密套接字协议层（SSL）”为“总是信任”。\n注意：导入 goagent 根证书会有安全隐患，有可能会导致中间人攻击，请谨慎使用。" = "Import goagent CA to resolve certificates error when visit HTTPS sites.\nNotice: Import goagent CA will cause security risk, such as middle-man attack, use as your own risk.";

"用于例外情况时获取网页内容的代理服务器" = "Used for get web page content";

"goagent 服务密码" = "goagent server password";

"一般情况下，本页配置无需更改。如果需要修改，请明白各选项的作用。" = "Usually it does not need modify settings on this page";

"服务器地址：" = "Server Address";

"服务端端口：" = "Server Port";

"本地监听的端口，需大于 1024，默认为 7070" = "Local listen port, need greater than 1024, default is 7070";

"SSH 服务器地址" = "SSH Server Address";

"默认端口为 22" = "Default Port is 22";

"允许非本机使用" = "Share Service to Local Network";

"登录 SSH 服务器所用的用户名" = "Username for connecting to SSH Server";

"SSH 账号密码，如果使用 Public Key 登录，可以不填" = "Password of SSH account, if login with Public Key please leave blank";

"使用 Public Key 代替密码登录" = "Login with Public Key";

"自定义 SSH 私钥文件：" = "Custom Private Key:";

"不使用默认 ~/.ssh 下的私钥，自定义私钥文件" = "Use custom private key instead of ~/.ssh";

"本地监听的端口，需大于 1024，默认为 8080" = "Local listen port, needs greater than 1024, default is 8800";

"使用服务器：" = "Use Server:";

"SSL 版本：" = "SSL Version:";

"所有版本" = "All Versions";

"服务器列表：" = "Server List:";

"显示示例" = "Show Example";

"每行一个服务器地址，请按以下格式填写：\n本地端口 : 远程服务器 : 远程服务器端口\n其中本地端口可以省略（省略时将会从上面设置的本地端口顺序增加，如 8801）。\n如果需要分隔为多个 service，请使用空行分隔。" = "Every server address each line, example:\nLocal Port:Remote Server:Remote Port\nLocal Port is optional (If omitted Local Port will be increased by Local Port above, such as 8801).\nIf needs seperate to multiple service, seperate servers with blank line.";

"ShadowSocks 服务器地址" = "ShadowSocks Server Address";

"本地监听的端口，需大于 1024" = "Local listen port, needs greater than 1024";

"ShadowSocks 服务器监听端口" = "ShadowSocks Server Listen Port";

"ShadowSocks 超时设置" = "ShadowSocks Timeout Setting";

"连接超时（秒）：" = "Timeout (Seconds):";

"ShadowSocks 服务密码" = "ShadowSocks Service Password";

"加密方式：" = "Encrypt Method:";

"table（默认）" = "table (Default)";

"服务端部署请到 https://github.com/clowwindy/shadowsocks 获取" = "Get server code from https://github.com/clowwindy/shadowsocks";

"启动成功修改系统代理设置为“全局通过代理访问”" = "Modify system proxy setting to \"Use as System Global Proxy\"";

"启动成功后修改系统代理设置为“自动代理配置（PAC）”" = "Modify system porxy setting to Use \"Automatic Proxy Configuration (PAC)\"";

"需要与相关扩展（例如 SwitchySharp）配合使用。" = "Use with other extensions (SwitchSharp etc.)";

"只有在 PAC 文件和自定义 PAC 域名列表中的网站才会通过代理访问。" = "Only domains in PAC or Custom PAC Domains List will access through proxy";

"PAC 服务使用固定端口：" = "Fixed PAC Service Port:";

"当前内置 PAC 服务地址：" = "Current PAC Address:";

"使用自定义 PAC 地址" = "Use Custom PAC Address";

"例如 http://example.com/proxy.pac" = "For example: http://example.com/proxy.pac";

"如 9999" = "Such as 9999";

"自定义 PAC 域名列表" = "Custom PAC Domains List";

"输入需要通过 GoAgentX 访问的域名列表，每行一个，支持通配符 *，例如 *.google.com 。在修改完域名列表后，需要应用后才会生效。" = "Input domains need access through proxy, one site each line, supports Wildcard, for example: *.google.com\nMust Apply after edit for making effective.";

"应\n用" = "Apply";

"需要重新启动本程序来生效" = "Needs restart GoAgentX";

"自动启动" = "AutoStart";

"在用户登录时自动启动 GoAgentX" = "Auto start GoAgentX after login";

"在用户第一次登录进入 Mac OS X 时，自动运行 GoAgentX" = "Auto start GoAgentX when user logged in";

"goagent 根证书" = "goagent CA";

"其他" = "Others";

"GoAgentX 窗口总是置顶" = "Make GoAgentX's main window always on top";

"服务状态改变通知" = "Send Service Status Changed Notification";

"停止" = "Stop";

"启动" = "Start";

"清除日志" = "Clear Logs";

"日志：" = "Logs:";

"正在运行" = "Running";

"未配置" = "Unconfigured";

"，端口 %d" = ", port %d";

"已停止" = "Stopped";

"停止重连" = "Stop Reconnect";

"Stunnel 服务器列表示例" = "Stunnel Server List Example";

"西厢第3季" = "west-chamber-season-3";

"goagent 服务端部署" = "goagent Server Deploy";

"goagent 更新" = "goagent Update";

"请进行服务配置" = "Please configure service first";

"正在启动" = "Starting";

"启动完成" = "Start finished";

"服务器端口：" = "Server Port:";

"高级设置..." = "Advanced...";

"日志..." = "Log...";

"启动状态" = "ON";

"停止状态" = "OFF";

"配置文件模板" = "Configuration Template";

"使用自定义配置文件模板" = "Use Customize Configuration Template";

"确定" = "OK";

"输入配置文件“%@”复制后的名称。" = "Enter a name for the duplicate of \"%@\"";

"配置名称：" = "Profile Name:";

"复制dup" = "Duplicate";

"取消" = "Cancel";

"创建" = "Create";

"请选择要使用的服务类型并输入配置文件名称。" = "Select a service and enter a name for the new profile.";

"服务类型：" = "Service Type:";

"这是内置的配置文件，您无法删除。" = "This is a built-in profile and can not be deleted.";

"这是内置的配置文件，您无法重命名。" = "This is a built-in profile and can not be renamed.";

"您确定要删除配置文件“%@”吗？" = "Are you sure to delete profile \"%@\"?";

"删除配置文件后将不可恢复。" = "Deleted profile will can not be recovered.";

"新配置文件名称：" = "New Profile Name:";

"重命名" = "Rename";

"输入配置文件“%@”的新名称。" = "Enter a new name of profile \"%@\".";

"复制配置..." = "Duplicate Profile...";

"重命名配置..." = "Rename Profile...";

"设定配置优先级..." = "Set Profile Priority...";

"导入配置..." = "Import Profiles...";

"导出配置..." = "Export Profiles...";

"关闭" = "Close";

"直接连接" = "Direct Connection";

"默认连接使用配置：" = "Default Profile:";

"应用" = "Apply";

"域名" = "Domain";

"使用配置" = "Use Profile";

"过滤规则" = "Filter Rules";

"设置" = "Settings";

"规则列表" = "Rules";

"网址：" = "URL:";

"选择本地文件..." = "Select Local File...";

"或者" = "Or";

"自动选择" = "Use Running Profiles";

"设置使用配置" = "Use Profile";

"启用规则" = "Enable Rules";

"禁用规则" = "Disable Rules";

"删除规则" = "Remove Rules";

"高级设置" = "Advanced Configuration";

"启用 GoAgentX API 支持" = "Enable GoAgentX API Support";

"导入" = "Import";

"请填写要导入的域名列表或规则列表，每行一个：" = "Please fill the domains or rules you want to import below, one  per line:";

"使用配置：" = "Use Profile:";

"服务顺序（拖放来改变顺序）：" = "Profiles Order (Drag profiles to change order):";

"这里的规则仅在使用“自动代理配置（PAC）”模式时有效。" = "The Rules only be applied when use \"Automatic Proxy Configuration\" mode.";

"禁用" = "Disable";

"启用" = "Enable";

"删除" = "Remove";

"删除 Bundle" = "Remove Bundle";

"确定要删除 Bundle “%@” 吗？\n- 如果它内置了配置文件，将同时被删除\n- 依赖于此 Bundle 的配置文件将会被禁用" = "Are you sure to remove Bundle \"%@\"?\n- If the bundle has profiles embeded, the profiles will be deleted together\n- Profiles depend this Bundle will be disabled";

"该 Bundle 已存在，是否覆盖？" = "The Bundle is already exists, overwrite it?";

"安装 Bundle" = "Install Bundle";

"模式：" = "Mode:";

"独立" = "Standalone";

"全局代理" = "Global Proxy";

"自动代理配置（PAC）" = "Automatic Proxy Configuration";

"以下设置仅在使用“自动代理配置（PAC）”模式时有效。" = "The settings below only available when use \"Automatic Proxy Configuration\" mode.";

"在浏览器中查看" = "View in Browser";

"内置 PAC 服务：" = "PAC Server:";

"重启 PAC 服务" = "Restart PAC Server";

"独立模式" = "Standalone Mode";

"全局代理模式" = "Global Proxy Mode";

"自动代理配置（PAC）模式" = "Automatic Proxy Configuration Mode";

"规则" = "Rule";

"PAC 请求记录" = "PAC Request Log";

"可以在规则中使用 useragent:Twitter 的格式来指定程序使用特定配置。仅在“自动代理配置”模式中有效。" = "Use format useragent:Twitter in rule for making Application use the specified profile.";

"注意：GoAgentX API 支持仅在使用“自动代理配置”模式时有效。" = "GoAgentX API Support only available when use \"Automatic Proxy Configuration\" mode.";

"与其他程序集成：" = "Integrate with other applications:";

"规则助手..." = "Rule Assistant...";

"规则助手快捷键：" = "Rule Assistant Shortcut:";

"[%@] %@ 正在运行，端口 %d" = "[%@] %@ is running, listening port %d";

"[%@] %@ 已停止" = "[%@] %@ stopped";

"已切换到 %@" = "Switched to %@";

"导入 autoproxy2pac 规则" = "Import autoproxy2pac Rules";

"是否导入 autoproxy2pac 的规则？如不导入您将需要自行添加规则。" = "Should import autoproxy2pac rules?\nIf not you need add rules manually.";

"重置所有提示" = "Reset All Warnings";

"所有提示已重置" = "All warnings were reseted";

"Autoproxy2pac 规则已导入" = "Autoproxy2pac Rules Imported";

"在服务列表中显示服务使用的本地端口" = "Display local port of service in services list";

"复制" = "Copy";

"这是第一次运行 GoAgentX，请设置以下选项以便更好地使用 GoAgentX。" = "It is the first time running GoAgentX, please setup GoAgentX for better experience.";

"导入 autoproxy2pac 规则列表" = "Import autoproxy2pac Rules";

"这将会导入常见需要使用代理访问的网站列表，如果不导入，您需要自行添加规则。建议选择。\n关于 autoproxy2pac，请访问 http://autoproxy2pac.appspot.com" = "It will import common rules for sites which needs access with proxy, if not, you need add rules manually.\nAbout autoproxy2pac, visit http://autoproxy2pac.appspot.com";

"安装 gfanqiang 配置包" = "Install gfanqiang Bundle";

"这将会安装 gfanqiang 的 goagent 配置包，如果您没有自己的 goagent app id，那么可以安装此配置包。" = "It will install gfanqiang profile for goagent, if you don't have a goagent app id, you can choose this.";

"开始使用 GoAgentX" = "Start using GoAgentX";

"检查更新..." = "Check for Updates...";

"修改 PAC 服务相关设置后，请重新启动 PAC 服务。" = "Please restart PAC server after modified settings.";

"分享 PAC 服务给局域网中的其他设置" = "Share PAC service to other devices in the LAN";

"重新运行 GoAgentX" = "Restart GoAgentX";

"需要重新运行程序来使改动生效" = "Needs restart to make modification take effects";

"恢复默认设置" = "Reset All Settings";

"确定要恢复所有设置吗？" = "Are you sure to reset all settings?";

"修改将会在程序重新启动后生效" = "Modification will take effect after restart GoAgentX";

"全局代理模式时，如果有多个服务运行，尽可能同时使用 SOCKS 和 HTTP 代理" = "When use Global mode, use both SOCKS and HTTP proxy if possible";

"优先级" = "Priority";

"设置优先级" = "Set Priority";

"这里的规则将用于生成 PAC 或系统代理的忽略主机或域名列表" = "Rules will be used for generating PAC or Bypass Hosts & Domain of System Proxy Settings";

"安装 Helper" = "Install Helper";

"更新 Helper" = "Update Helper";

"删除 Helper" = "Remove Helper";

"Helper 版本: %@" = "Helper Versoin: %@";

"请在终端中运行以下命令：" = "Please run follow commands in Terminal:";

"菜单栏图标直接打开主窗口" = "Using MenuBar item to show main window";

"不更新" = "Don't Update";

"不安装" = "Don't Install";

"安装 GoAgentX Helper 可以让 GoAgentX 在切换使用模式时不需要弹出授权提示。\n\n在安装后您也可以自行删除 Helper。" = "Install GoAgentX Helper will make GoAgentX switching mode without user authorization.\n\nYou can remove helper by yourself later.";

"不发送 Google Analytics 统计信息" = "Don't send Google Analytics information";

"导入内置规则" = "Import Embeded Rules";

"规则中已经指定配置时除外" = "Except rules with specified profile";

"临时禁用所有规则" = "Disable All Rules Temporarily";

"启用代理时，修改系统中所有网络接口的代理设置" = "Modify all interfaces' proxy setting when proxy enabled";

"PAC 模式将全局使用默认连接，全局模式将不更新 bypass 列表" = "PAC mode will use default connection profile for all connections, Global mode will do not update bypass list";

"导出" = "Export";

"所有规则" = "All Rules";

"选中的规则" = "Selected Rules";

"导入 GoAgentX 规则" = "Import GoAgentX Rules";

"是否导入 GoAgentX PAC 规则？" = "Do you want import GoAgentX PAC rules?";

"退出程序或停止所有服务时，修改系统代理设置为不使用代理" = "Clear all system proxy settings when exit or stop all profiles";
